#+STARTUP: folded indent
#+PROPERTY: header-args:R :results output :colnames yes :session *R:tsibble*

* ~{tsibble}~: Easily tidy data with spread and gather functions     :noexport:

~{tsibble}~ (タイディーアー) は、R の ~data.frame~ を操作するパッケージ。Tidy Data (整然データ) を作成するために用いられる。収録されている関数は、おおよそ 5 つほどのカテゴリーに分類できる。

- ~data.frame~ を縦長 (longer)・横長 (wider) に変換する関数
- ネストされた ~data.frame~ を作成するための関数
- ~NA~ 処理の関数
- 列の分割・結合の関数
- 直積集合を作る関数 (改良版 ~expand.grid()~)
\\

* 目次                                                            :quote:toc:
#+BEGIN_QUOTE
- [[#ライブラリの読み込みとバージョンの確認][ライブラリの読み込みとバージョンの確認]]
- [[#関数リスト][関数リスト]]
  - [[#as_tsibblex-key--null-index-regular--true-validate--true-drop--true-][~as_tsibble(x, key = NULL, index, regular = TRUE, validate = TRUE, .drop = TRUE, ...)~.]]
  - [[#index-types][Index types]]
  - [[#fill_gapsdata--full--false][~fill_gaps(.data, ..., .full = FALSE)~.]]
  - [[#rolling-window][Rolling window]]
- [[#実行環境][実行環境]]
- [[#参考リンク][参考リンク]]
#+END_QUOTE

* ライブラリの読み込みとバージョンの確認

#+begin_src R :results silent
library(tsibble)
library(tidyverse)
#+end_src
\\

- バージョン
#+begin_src R :exports both
packageVersion("tsibble")
#+end_src

#+RESULTS:
: [1] ‘0.8.4’
\\

* 関数リスト
** ~as_tsibble(x, key = NULL, index, regular = TRUE, validate = TRUE, .drop = TRUE, ...)~.

- index = 時間
  - 重複は NG (index+key でユニークになるように設定する)
  - 自動的に interval を判定してくれる
- key = なんらかのキー
- ~nycflights13::weather~ データセットを使う

#+begin_src R
weather <- nycflights13::weather %>%
  select(origin, time_hour, temp, humid, precip)
weather_tsbl <- as_tsibble(weather, key = origin, index = time_hour)
weather_tsbl
#+end_src

#+RESULTS:
#+begin_example
# A tsibble: 26,115 x 5 [1h] <America/New_York>
# Key:       origin [3]
   origin time_hour            temp humid precip
   <chr>  <dttm>              <dbl> <dbl>  <dbl>
 1 EWR    2013-01-01 01:00:00  39.0  59.4      0
 2 EWR    2013-01-01 02:00:00  39.0  61.6      0
 3 EWR    2013-01-01 03:00:00  39.0  64.4      0
 4 EWR    2013-01-01 04:00:00  39.9  62.2      0
 5 EWR    2013-01-01 05:00:00  39.0  64.4      0
 6 EWR    2013-01-01 06:00:00  37.9  67.2      0
 7 EWR    2013-01-01 07:00:00  39.0  64.4      0
 8 EWR    2013-01-01 08:00:00  39.9  62.2      0
 9 EWR    2013-01-01 09:00:00  39.9  62.2      0
10 EWR    2013-01-01 10:00:00  41    59.6      0
# … with 26,105 more rows
#+end_example
\\

- ~tbl_ts~ class
#+begin_src R
class(weather_tsbl)
#+end_src

#+RESULTS:
: [1] "tbl_ts"     "tbl_df"     "tbl"        "data.frame"
\\

** Index types

- ~yearquarter()~
- ~yearmonth()~
- ~yearweek()~

** ~fill_gaps(.data, ..., .full = FALSE)~.

- 時系列データの欠損値処理

#+begin_src R
full_weather <- weather_tsbl %>%
  fill_gaps(precip = 0) %>%
  group_by_key() %>%
  tidyr::fill(temp, humid, .direction = "down")
full_weather
#+end_src

#+RESULTS:
#+begin_example
# A tsibble: 26,190 x 5 [1h] <America/New_York>
# Key:       origin [3]
# Groups:    origin [3]
   origin time_hour            temp humid precip
   <chr>  <dttm>              <dbl> <dbl>  <dbl>
 1 EWR    2013-01-01 01:00:00  39.0  59.4      0
 2 EWR    2013-01-01 02:00:00  39.0  61.6      0
 3 EWR    2013-01-01 03:00:00  39.0  64.4      0
 4 EWR    2013-01-01 04:00:00  39.9  62.2      0
 5 EWR    2013-01-01 05:00:00  39.0  64.4      0
 6 EWR    2013-01-01 06:00:00  37.9  67.2      0
 7 EWR    2013-01-01 07:00:00  39.0  64.4      0
 8 EWR    2013-01-01 08:00:00  39.9  62.2      0
 9 EWR    2013-01-01 09:00:00  39.9  62.2      0
10 EWR    2013-01-01 10:00:00  41    59.6      0
# … with 26,180 more rows
#+end_example

** Rolling window

- ~slide()~, ~slide2()~, ~pslide()~
- ~tile()~, ~tile2()~, ~ptile()~
- ~stretch()~, ~strech2()~, ~pstretch()~
- 並列処理
  - ~future_*()~
- リストで返却
  - ~slider()~ などの r で終わる亜種

- ~slide(.x, .f, ..., .size = 1, .step = 1, .fill = NA, .partial = FALSE, .align = "right", .bind = FALSE)~

#+begin_src R
full_weather %>%
  group_by_key() %>%
  mutate(temp_ma = slide_dbl(temp, ~ mean(., na.rm = TRUE), .size = 3))
#+end_src

#+RESULTS:
#+begin_example
# A tsibble: 26,190 x 6 [1h] <America/New_York>
# Key:       origin [3]
# Groups:    origin [3]
   origin time_hour            temp humid precip temp_ma
   <chr>  <dttm>              <dbl> <dbl>  <dbl>   <dbl>
 1 EWR    2013-01-01 01:00:00  39.0  59.4      0    NA
 2 EWR    2013-01-01 02:00:00  39.0  61.6      0    NA
 3 EWR    2013-01-01 03:00:00  39.0  64.4      0    39.0
 4 EWR    2013-01-01 04:00:00  39.9  62.2      0    39.3
 5 EWR    2013-01-01 05:00:00  39.0  64.4      0    39.3
 6 EWR    2013-01-01 06:00:00  37.9  67.2      0    39.0
 7 EWR    2013-01-01 07:00:00  39.0  64.4      0    38.7
 8 EWR    2013-01-01 08:00:00  39.9  62.2      0    39.0
 9 EWR    2013-01-01 09:00:00  39.9  62.2      0    39.6
10 EWR    2013-01-01 10:00:00  41    59.6      0    40.3
# … with 26,180 more rows
#+end_example

* 実行環境

#+begin_src R :results output :exports both
sessionInfo()
#+end_src

#+RESULTS:
#+begin_example
R version 3.6.1 (2019-07-05)
Platform: x86_64-pc-linux-gnu (64-bit)
Running under: Ubuntu 18.04.3 LTS

Matrix products: default
BLAS:   /usr/lib/x86_64-linux-gnu/blas/libblas.so.3.7.1
LAPACK: /usr/lib/x86_64-linux-gnu/lapack/liblapack.so.3.7.1

locale:
 [1] LC_CTYPE=en_US.UTF-8       LC_NUMERIC=C
 [3] LC_TIME=en_US.UTF-8        LC_COLLATE=en_US.UTF-8
 [5] LC_MONETARY=en_US.UTF-8    LC_MESSAGES=en_US.UTF-8
 [7] LC_PAPER=en_US.UTF-8       LC_NAME=C
 [9] LC_ADDRESS=C               LC_TELEPHONE=C
[11] LC_MEASUREMENT=en_US.UTF-8 LC_IDENTIFICATION=C

attached base packages:
[1] stats     graphics  grDevices utils     datasets  methods   base

other attached packages:
 [1] forcats_0.4.0   stringr_1.4.0   dplyr_0.8.3     purrr_0.3.3
 [5] readr_1.3.1     tidyr_1.0.0     tibble_2.1.3    ggplot2_3.2.1
 [9] tidyverse_1.2.1 tsibble_0.8.4

loaded via a namespace (and not attached):
 [1] Rcpp_1.0.2        cellranger_1.1.0  pillar_1.4.2      compiler_3.6.1
 [5] prettyunits_1.0.2 progress_1.2.2    tools_3.6.1       zeallot_0.1.0
 [9] jsonlite_1.6      lubridate_1.7.4   lifecycle_0.1.0   nlme_3.1-141
[13] gtable_0.3.0      lattice_0.20-38   anytime_0.3.6     pkgconfig_2.0.3
[17] rlang_0.4.0       cli_1.9.9.9000    rstudioapi_0.10   haven_2.1.1
[21] withr_2.1.2       xml2_1.2.2        httr_1.4.1        generics_0.0.2
[25] vctrs_0.2.0       hms_0.5.1         grid_3.6.1        tidyselect_0.2.5
[29] glue_1.3.1        R6_2.4.0          fansi_0.4.0       readxl_1.3.1
[33] modelr_0.1.5      magrittr_1.5      backports_1.1.5   scales_1.0.0
[37] rvest_0.3.4       assertthat_0.2.1  colorspace_1.4-1  stringi_1.4.3
[41] lazyeval_0.2.2    munsell_0.5.0     broom_0.5.2       crayon_1.3.4
#+end_example
\\

* 参考リンク

- [[https://tsibble.tidyverts.org/][公式サイト]]
- [[https://cloud.r-project.org/web/packages/tsibble/index.html][CRAN]]
- [[https://cloud.r-project.org/web/packages/tsibble/tsibble.pdf][Reference Manual]]
- [[https://github.com/tidyverts/tsibble][Github Repo]]
- Vignette
  - [[https://cloud.r-project.org/web/packages/tsibble/vignettes/intro-tsibble.html][Introduction to tsibble]]
  - [[https://cloud.r-project.org/web/packages/tsibble/vignettes/window.html][A family of window functions]]
  - [[https://cloud.r-project.org/web/packages/tsibble/vignettes/implicit-na.html][Handle implicit missingness with tsibble]]
  - [[https://cloud.r-project.org/web/packages/tsibble/vignettes/faq.html][Frequently Asked Questions and Answers]]
- Blog
  - [[https://speakerdeck.com/t_usausausa/tsibbletotibbletimefalseshao-jie][tsibbleとtibbletimeの紹介@speakerdeck]]
